{
  "generatedAt": "2026-02-21T14:02:06.640Z",
  "sources": [
    {
      "name": "Apple",
      "humanUrl": "https://techcrunch.com/tag/apple/",
      "items": [
        {
          "title": "Apple’s iOS 26.4 arrives in public beta with AI music playlists, video podcasts, and more",
          "link": "https://techcrunch.com/2026/02/20/apples-ios-26-4-arrives-in-public-beta-with-ai-music-playlists-video-podcasts-and-more/",
          "content": "Several updates are introduced in iOS 26.4, including an AI-powered playlist-generation feature in Apple Music, support for video content in the Podcasts app, end-to-end encry"
        },
        {
          "title": "Rivian owners will soon be able to access vehicle controls using their Apple Watch",
          "link": "https://techcrunch.com/2026/02/19/rivian-owners-will-be-able-to-access-vehicle-controls-through-their-apple-watch/",
          "content": "Rivian is launching a companion app that pairs with Apple Watch in the coming week."
        },
        {
          "title": "Apple is reportedly cooking up a trio of AI wearables",
          "link": "https://techcrunch.com/2026/02/17/apple-is-reportedly-cooking-up-a-trio-of-ai-wearables/",
          "content": "As the AI hardware space heats up, the iPhone maker has multiple smart products in development."
        },
        {
          "title": "Apple Podcasts is getting an enhanced video experience this spring",
          "link": "https://techcrunch.com/2026/02/17/apple-podcasts-is-getting-an-enhanced-video-experience-this-spring/",
          "content": "By bringing an enhanced video podcast viewing experience to its app, Apple is aiming to keep users from turning to rival platforms to watch their favorite shows."
        }
      ]
    },
    {
      "name": "Microsoft",
      "humanUrl": "https://techcrunch.com/tag/microsoft/",
      "items": [
        {
          "title": "All the important news from the ongoing India AI Impact Summit",
          "link": "https://techcrunch.com/2026/02/19/all-the-important-news-from-the-ongoing-india-ai-summit/",
          "content": "India is hosting a four-day AI Summit this week that will be attended by executives from major AI labs and Big Tech, including OpenAI, Anthropic, Nvidia, Microsoft, Google, an"
        },
        {
          "title": "Microsoft says Office bug exposed customers’ confidential emails to Copilot AI",
          "link": "https://techcrunch.com/2026/02/18/microsoft-says-office-bug-exposed-customers-confidential-emails-to-copilot-ai/",
          "content": "Microsoft said the bug meant that its Copilot AI chatbot was reading and summarizing paying customers' confidential emails, bypassing data-protection policies."
        },
        {
          "title": "Microsoft says hackers are exploiting critical zero-day bugs to target Windows and Office users",
          "link": "https://techcrunch.com/2026/02/11/microsoft-says-hackers-are-exploiting-critical-zero-day-bugs-to-target-windows-and-office-users/",
          "content": "Critical security flaws targeting Windows and Office users allow hackers to take complete control of a victim's computer by clicking a malicious link or opening a file. Patch "
        },
        {
          "title": "How AI changes the math for startups, according to a Microsoft VP",
          "link": "https://techcrunch.com/2026/02/11/how-ai-changes-the-math-for-startups-according-to-a-microsoft-vp/",
          "content": "Amanda Silver is a corporate vice president at Microsoft’s CoreAI division, where she works on tools for deploying apps and agentic systems within enterprises."
        }
      ]
    },
    {
      "name": "Business",
      "humanUrl": "https://www.nytimes.com/section/business",
      "items": [
        {
          "title": "Inside the Big Tech Lobbying Machine Aiming to Halt Social Media Bans",
          "link": "https://www.nytimes.com/2026/02/21/business/dealbook/big-tech-lobbying-social-media-bans.html",
          "content": "Tech giants, including Meta and Alphabet, are spending lavishly on splashy billboard ads, courting on-the-fence politicians and bulking up their ranks of lobbyists."
        },
        {
          "title": "For India, Buying Russian Oil Just Got More Complicated",
          "link": "https://www.nytimes.com/2026/02/21/business/india-russia-oil-trump-tariffs.html",
          "content": "India’s prime minister acceded to many of President Trump’s demands under pressure of heavy tariffs. It would be awkward to reject them now."
        },
        {
          "title": "Fred Segal Has a New Owner. This Time It’s Aritzia.",
          "link": "https://www.nytimes.com/2026/02/21/style/fred-segal-has-a-new-owner-again.html",
          "content": "The storied Los Angeles retailer, once recognized as an arbiter of West Coast style, has been acquired by the mass-market brand Aritzia."
        },
        {
          "title": "He Researched Dishonesty. He Got Friendly With Jeffrey Epstein.",
          "link": "https://www.nytimes.com/2026/02/21/business/jeffrey-epstein-dan-ariely-dishonesty.html",
          "content": "Dan Ariely, a behavioral scientist at Duke, sought out the convicted sex offender for his research. Their yearslong correspondence suggests it wasn’t all business."
        }
      ]
    }
  ]
}
