{
  "generatedAt": "2026-02-25T16:50:37.592Z",
  "sources": [
    {
      "name": "Apple",
      "humanUrl": "https://techcrunch.com/tag/apple/",
      "items": [
        {
          "title": "Apple rolls out age-verification tools worldwide to comply with growing web of child safety laws",
          "link": "https://techcrunch.com/2026/02/24/apple-rolls-out-age-verification-tools-worldwide-to-comply-with-growing-web-of-child-safety-laws/",
          "content": "Apple complies with new age-assurance laws in the U.S. and abroad, including those that block users from downloading apps aimed at adults."
        },
        {
          "title": "Apple might take a new approach to announcing its next products",
          "link": "https://techcrunch.com/2026/02/22/apple-might-take-a-new-approach-to-announcing-its-next-products/",
          "content": "Apple has invited the tech press to a “special Apple experience” on March 4, but it might unfold a bit differently than the company's standard press event."
        },
        {
          "title": "Apple’s iOS 26.4 arrives in public beta with AI music playlists, video podcasts, and more",
          "link": "https://techcrunch.com/2026/02/20/apples-ios-26-4-arrives-in-public-beta-with-ai-music-playlists-video-podcasts-and-more/",
          "content": "Several updates are introduced in iOS 26.4, including an AI-powered playlist-generation feature in Apple Music, support for video content in the Podcasts app, end-to-end encry"
        },
        {
          "title": "Rivian owners will soon be able to access vehicle controls using their Apple Watch",
          "link": "https://techcrunch.com/2026/02/19/rivian-owners-will-be-able-to-access-vehicle-controls-through-their-apple-watch/",
          "content": "Rivian is launching a companion app that pairs with Apple Watch in the coming week."
        }
      ]
    },
    {
      "name": "Microsoft",
      "humanUrl": "https://techcrunch.com/tag/microsoft/",
      "items": [
        {
          "title": "All the important news from the ongoing India AI Impact Summit",
          "link": "https://techcrunch.com/2026/02/22/all-the-important-news-from-the-ongoing-india-ai-summit/",
          "content": "India is hosting a four-day AI Summit this week that will be attended by executives from major AI labs and Big Tech, including OpenAI, Anthropic, Nvidia, Microsoft, Google, an"
        },
        {
          "title": "Microsoft’s new gaming CEO vows not to flood the ecosystem with ‘endless AI slop’",
          "link": "https://techcrunch.com/2026/02/21/microsofts-new-gaming-ceo-vows-not-to-flood-the-ecosystem-with-endless-ai-slop/",
          "content": "Is Microsoft's gaming division doubling down on AI?"
        },
        {
          "title": "Microsoft says Office bug exposed customers’ confidential emails to Copilot AI",
          "link": "https://techcrunch.com/2026/02/18/microsoft-says-office-bug-exposed-customers-confidential-emails-to-copilot-ai/",
          "content": "Microsoft said the bug meant that its Copilot AI chatbot was reading and summarizing paying customers' confidential emails, bypassing data-protection policies."
        },
        {
          "title": "Microsoft says hackers are exploiting critical zero-day bugs to target Windows and Office users",
          "link": "https://techcrunch.com/2026/02/11/microsoft-says-hackers-are-exploiting-critical-zero-day-bugs-to-target-windows-and-office-users/",
          "content": "Critical security flaws targeting Windows and Office users allow hackers to take complete control of a victim's computer by clicking a malicious link or opening a file. Patch "
        }
      ]
    },
    {
      "name": "Business",
      "humanUrl": "https://www.nytimes.com/section/business",
      "items": [
        {
          "title": "Blaming Tariffs, Aston Martin to Trim 20% of Its Work Force",
          "link": "https://www.nytimes.com/2026/02/25/business/tariffs-aston-martin.html",
          "content": "The luxury automaker said losses for 2025 had increased from the year before, as tariffs and geopolitical uncertainty take a toll on its operations."
        },
        {
          "title": "What Trump Did (and Didn’t) Say in the State of the Union Speech",
          "link": "https://www.nytimes.com/2026/02/25/business/dealbook/trump-state-of-union.html",
          "content": "The president boasted about a strong economy in his State of the Union address. But he spent less time on a potential weakness, affordability."
        },
        {
          "title": "Bleak Research Report Stokes A.I. Debate on Wall St.",
          "link": "https://www.nytimes.com/2026/02/25/business/citrini-ai-stock-market.html",
          "content": "In a widely circulated note, Citrini Research painted a dire picture of job losses and stock market sell-offs, though many analysts and economists questioned its conclusions."
        },
        {
          "title": "From the French Riviera to Kyoto, Japan, 5 New Luxury Hotels",
          "link": "https://www.nytimes.com/2026/02/25/travel/luxury-hotels.html",
          "content": "From palatial to contemporary to luxuriously rustic, this collection of new resorts and inns offers spas, private gardens, fine restaurants and exquisite settings."
        }
      ]
    }
  ]
}
