{
  "generatedAt": "2026-02-24T16:17:22.887Z",
  "sources": [
    {
      "name": "Apple",
      "humanUrl": "https://techcrunch.com/tag/apple/",
      "items": [
        {
          "title": "Apple might take a new approach to announcing its next products",
          "link": "https://techcrunch.com/2026/02/22/apple-might-take-a-new-approach-to-announcing-its-next-products/",
          "content": "Apple has invited the tech press to a “special Apple experience” on March 4, but it might unfold a bit differently than the company's standard press event."
        },
        {
          "title": "Apple’s iOS 26.4 arrives in public beta with AI music playlists, video podcasts, and more",
          "link": "https://techcrunch.com/2026/02/20/apples-ios-26-4-arrives-in-public-beta-with-ai-music-playlists-video-podcasts-and-more/",
          "content": "Several updates are introduced in iOS 26.4, including an AI-powered playlist-generation feature in Apple Music, support for video content in the Podcasts app, end-to-end encry"
        },
        {
          "title": "Rivian owners will soon be able to access vehicle controls using their Apple Watch",
          "link": "https://techcrunch.com/2026/02/19/rivian-owners-will-be-able-to-access-vehicle-controls-through-their-apple-watch/",
          "content": "Rivian is launching a companion app that pairs with Apple Watch in the coming week."
        },
        {
          "title": "Apple is reportedly cooking up a trio of AI wearables",
          "link": "https://techcrunch.com/2026/02/17/apple-is-reportedly-cooking-up-a-trio-of-ai-wearables/",
          "content": "As the AI hardware space heats up, the iPhone maker has multiple smart products in development."
        }
      ]
    },
    {
      "name": "Microsoft",
      "humanUrl": "https://techcrunch.com/tag/microsoft/",
      "items": [
        {
          "title": "All the important news from the ongoing India AI Impact Summit",
          "link": "https://techcrunch.com/2026/02/22/all-the-important-news-from-the-ongoing-india-ai-summit/",
          "content": "India is hosting a four-day AI Summit this week that will be attended by executives from major AI labs and Big Tech, including OpenAI, Anthropic, Nvidia, Microsoft, Google, an"
        },
        {
          "title": "Microsoft’s new gaming CEO vows not to flood the ecosystem with ‘endless AI slop’",
          "link": "https://techcrunch.com/2026/02/21/microsofts-new-gaming-ceo-vows-not-to-flood-the-ecosystem-with-endless-ai-slop/",
          "content": "Is Microsoft's gaming division doubling down on AI?"
        },
        {
          "title": "Microsoft says Office bug exposed customers’ confidential emails to Copilot AI",
          "link": "https://techcrunch.com/2026/02/18/microsoft-says-office-bug-exposed-customers-confidential-emails-to-copilot-ai/",
          "content": "Microsoft said the bug meant that its Copilot AI chatbot was reading and summarizing paying customers' confidential emails, bypassing data-protection policies."
        },
        {
          "title": "Microsoft says hackers are exploiting critical zero-day bugs to target Windows and Office users",
          "link": "https://techcrunch.com/2026/02/11/microsoft-says-hackers-are-exploiting-critical-zero-day-bugs-to-target-windows-and-office-users/",
          "content": "Critical security flaws targeting Windows and Office users allow hackers to take complete control of a victim's computer by clicking a malicious link or opening a file. Patch "
        }
      ]
    },
    {
      "name": "Business",
      "humanUrl": "https://www.nytimes.com/section/business",
      "items": [
        {
          "title": "Supreme Court Sides With Couple in Case Involving Baby Food Sold at Whole Foods",
          "link": "https://www.nytimes.com/2026/02/24/us/politics/supreme-court-whole-foods.html",
          "content": "The court agreed to revive a lawsuit by a Texas couple who claimed that tainted baby food purchased at Whole Foods had sickened their young son."
        },
        {
          "title": "More Than Half of Teens Use Chatbots for Schoolwork, Survey Finds",
          "link": "https://www.nytimes.com/2026/02/24/technology/schoolwork-chatbot-cheating-pew.html",
          "content": "A new study from the Pew Research Center finds teens think chatbot-assisted cheating has become “a regular feature of student life.”"
        },
        {
          "title": "Storm Leads to a First for The Boston Globe: A Day Without a Paper",
          "link": "https://www.nytimes.com/2026/02/24/business/media/boston-globe-storm.html",
          "content": "The company said the blizzard had made it too treacherous for workers to make it to the printing press on Monday."
        },
        {
          "title": "Trump’s Tariffs Go Into Effect at 10 Percent, Not 15",
          "link": "https://www.nytimes.com/2026/02/24/us/politics/trump-tariffs-global-trade.html",
          "content": "The change surprised executives and foreign leaders, who had been expecting the 15 percent rate the president announced on Saturday."
        }
      ]
    }
  ]
}
