{
  "generatedAt": "2026-02-18T15:38:08.500Z",
  "sources": [
    {
      "name": "Apple",
      "humanUrl": "https://techcrunch.com/tag/apple/",
      "items": [
        {
          "title": "Apple is reportedly cooking up a trio of AI wearables",
          "link": "https://techcrunch.com/2026/02/17/apple-is-reportedly-cooking-up-a-trio-of-ai-wearables/",
          "content": "As the AI hardware space heats up, the iPhone maker has multiple smart products in development."
        },
        {
          "title": "Apple Podcasts is getting an enhanced video experience this spring",
          "link": "https://techcrunch.com/2026/02/17/apple-podcasts-is-getting-an-enhanced-video-experience-this-spring/",
          "content": "By bringing an enhanced video podcast viewing experience to its app, Apple is aiming to keep users from turning to rival platforms to watch their favorite shows."
        },
        {
          "title": "Apple acquires all rights to ‘Severance,’ will produce future seasons in-house",
          "link": "https://techcrunch.com/2026/02/12/apple-acquires-all-rights-to-severance-will-produce-future-seasons-in-house/",
          "content": "The show is expected to run for four seasons, with the possibility of spin-offs, a prequel, and foreign versions."
        },
        {
          "title": "US FTC airs concerns over allegations that Apple News suppresses right-wing content",
          "link": "https://techcrunch.com/2026/02/12/us-ftc-airs-concerns-over-allegations-that-apple-suppresses-right-wing-content-on-apple-news/",
          "content": "In a letter to Apple CEO Tim Cook, FTC chair Andrew Ferguson cited reports from Media Research Center, a right-leaning think tank, which accused Apple of excluding right-leani"
        }
      ]
    },
    {
      "name": "Microsoft",
      "humanUrl": "https://techcrunch.com/tag/microsoft/",
      "items": [
        {
          "title": "Microsoft says Office bug exposed customers’ confidential emails to Copilot AI",
          "link": "https://techcrunch.com/2026/02/18/microsoft-says-office-bug-exposed-customers-confidential-emails-to-copilot-ai/",
          "content": "Microsoft said the bug meant that its Copilot AI chatbot was reading and summarizing paying customers' confidential emails, bypassing data protection policies."
        },
        {
          "title": "All the important news from the ongoing India AI Impact Summit",
          "link": "https://techcrunch.com/2026/02/16/all-the-important-news-from-the-ongoing-india-ai-summit/",
          "content": "India is hosting a four-day AI Summit this week that will be attended by executives from major AI labs and Big Tech, including OpenAI, Anthropic, Nvidia, Microsoft, Google, an"
        },
        {
          "title": "Microsoft says hackers are exploiting critical zero-day bugs to target Windows and Office users",
          "link": "https://techcrunch.com/2026/02/11/microsoft-says-hackers-are-exploiting-critical-zero-day-bugs-to-target-windows-and-office-users/",
          "content": "Critical security flaws targeting Windows and Office users allow hackers to take complete control of a victim's computer by clicking a malicious link or opening a file. Patch "
        },
        {
          "title": "How AI changes the math for startups, according to a Microsoft VP",
          "link": "https://techcrunch.com/2026/02/11/how-ai-changes-the-math-for-startups-according-to-a-microsoft-vp/",
          "content": "Amanda Silver is a corporate vice president at Microsoft’s CoreAI division, where she works on tools for deploying apps and agentic systems within enterprises."
        }
      ]
    },
    {
      "name": "Business",
      "humanUrl": "https://www.nytimes.com/section/business",
      "items": [
        {
          "title": "The New York Times Wins 3 Polk Awards",
          "link": "https://www.nytimes.com/2026/02/18/business/media/george-polk-awards.html",
          "content": "The Times was honored for its coverage of President Trump, the abuse of housekeepers and nannies in Saudi Arabia and brutality in New York prisons."
        },
        {
          "title": "Kentucky Derby Operator Accused of Regulatory ‘Freeloading’",
          "link": "https://www.nytimes.com/2026/02/18/business/churchill-downs-hisa-fees.html",
          "content": "The Horseracing Integrity and Safety Authority filed a complaint saying Churchill Downs Inc. is not paying its fair share to support inspections and testing."
        },
        {
          "title": "Elon Musk’s xAI Gets $3 Billion Investment From Saudi-Backed A.I. Firm",
          "link": "https://www.nytimes.com/2026/02/18/business/xai-humain-saudi-musk-spacex.html",
          "content": "Humain, which was created by Crown Prince Mohammed bin Salman last year, said it made the investment just before xAI was acquired by SpaceX, Mr. Musk’s rocket company."
        },
        {
          "title": "F.D.A. Reverses Decision and Agrees to Review Moderna’s Flu Vaccine",
          "link": "https://www.nytimes.com/2026/02/18/health/fda-moderna-flu-vaccine-mrna.html",
          "content": "Moderna said it had held further discussions with regulators and announced that the agency would accept the company’s application for approval of its flu vaccine that uses mRN"
        }
      ]
    }
  ]
}
