{
  "generatedAt": "2026-02-27T15:04:46.602Z",
  "sources": [
    {
      "name": "Apple",
      "humanUrl": "https://techcrunch.com/tag/apple/",
      "items": [
        {
          "title": "Apple rolls out age-verification tools worldwide to comply with growing web of child safety laws",
          "link": "https://techcrunch.com/2026/02/24/apple-rolls-out-age-verification-tools-worldwide-to-comply-with-growing-web-of-child-safety-laws/",
          "content": "Apple complies with new age-assurance laws in the U.S. and abroad, including those that block users from downloading apps aimed at adults."
        },
        {
          "title": "Apple might take a new approach to announcing its next products",
          "link": "https://techcrunch.com/2026/02/22/apple-might-take-a-new-approach-to-announcing-its-next-products/",
          "content": "Apple has invited the tech press to a “special Apple experience” on March 4, but it might unfold a bit differently than the company's standard press event."
        },
        {
          "title": "Apple’s iOS 26.4 arrives in public beta with AI music playlists, video podcasts, and more",
          "link": "https://techcrunch.com/2026/02/20/apples-ios-26-4-arrives-in-public-beta-with-ai-music-playlists-video-podcasts-and-more/",
          "content": "Several updates are introduced in iOS 26.4, including an AI-powered playlist-generation feature in Apple Music, support for video content in the Podcasts app, end-to-end encry"
        },
        {
          "title": "Rivian owners will soon be able to access vehicle controls using their Apple Watch",
          "link": "https://techcrunch.com/2026/02/19/rivian-owners-will-be-able-to-access-vehicle-controls-through-their-apple-watch/",
          "content": "Rivian is launching a companion app that pairs with Apple Watch in the coming week."
        }
      ]
    },
    {
      "name": "Microsoft",
      "humanUrl": "https://techcrunch.com/tag/microsoft/",
      "items": [
        {
          "title": "The White House wants AI companies to cover rate hikes. Most have already said they would.",
          "link": "https://techcrunch.com/2026/02/25/the-white-house-wants-ai-companies-to-cover-rate-hikes-most-have-already-said-they-would/",
          "content": "Many hyperscalers have already made public commitments to cover electricity cost increases."
        },
        {
          "title": "The public opposition to AI infrastructure is heating up",
          "link": "https://techcrunch.com/2026/02/25/the-public-opposition-to-ai-infrastructure-is-heating-up/",
          "content": "Public backlash over the data center boom is leading to a variety of draconian policies — including bans on new construction."
        },
        {
          "title": "All the important news from the ongoing India AI Impact Summit",
          "link": "https://techcrunch.com/2026/02/22/all-the-important-news-from-the-ongoing-india-ai-summit/",
          "content": "India is hosting a four-day AI Summit this week that will be attended by executives from major AI labs and Big Tech, including OpenAI, Anthropic, Nvidia, Microsoft, Google, an"
        },
        {
          "title": "Microsoft’s new gaming CEO vows not to flood the ecosystem with ‘endless AI slop’",
          "link": "https://techcrunch.com/2026/02/21/microsofts-new-gaming-ceo-vows-not-to-flood-the-ecosystem-with-endless-ai-slop/",
          "content": "Is Microsoft's gaming division doubling down on AI?"
        }
      ]
    },
    {
      "name": "Business",
      "humanUrl": "https://www.nytimes.com/section/business",
      "items": [
        {
          "title": "OpenAI Raises $110 Billion to Fuel Growth, Extending A.I. Boom",
          "link": "https://www.nytimes.com/2026/02/27/business/openai-funding.html",
          "content": "Amazon, Nvidia and SoftBank led the investment, valuing the parent of ChatGPT at $730 billion."
        },
        {
          "title": "The I.R.S. Shut Its Direct File, but Here Are Other Free Filing Options",
          "link": "https://www.nytimes.com/2026/02/27/your-money/irs-free-tax-filing.html",
          "content": "The agency still offers a Free File program that works with commercial tax software firms. Some companies also offer free tools for certain filers."
        },
        {
          "title": "E.U. Pushes Ahead With South American Trade Deal Despite Legal Challenge",
          "link": "https://www.nytimes.com/2026/02/27/business/eu-mercosur-trade.html",
          "content": "The provisional application of the agreement with Brazil, Argentina, Paraguay and Uruguay is intended to diversify Europe’s trading relationships."
        },
        {
          "title": "Paramount Is Set to Win Warner Bros. Now Comes the Hard Part.",
          "link": "https://www.nytimes.com/2026/02/27/business/dealbook/paramount-warner-bros-netflix.html",
          "content": "The media company controlled by the Ellisons out-dueled Netflix for control of Warner Bros. Discovery. The next step is making the combined media empires work."
        }
      ]
    }
  ]
}
