{
  "generatedAt": "2026-02-28T13:56:07.326Z",
  "sources": [
    {
      "name": "Apple",
      "humanUrl": "https://techcrunch.com/tag/apple/",
      "items": [
        {
          "title": "Apple rolls out age-verification tools worldwide to comply with growing web of child safety laws",
          "link": "https://techcrunch.com/2026/02/24/apple-rolls-out-age-verification-tools-worldwide-to-comply-with-growing-web-of-child-safety-laws/",
          "content": "Apple complies with new age-assurance laws in the U.S. and abroad, including those that block users from downloading apps aimed at adults."
        },
        {
          "title": "Apple might take a new approach to announcing its next products",
          "link": "https://techcrunch.com/2026/02/22/apple-might-take-a-new-approach-to-announcing-its-next-products/",
          "content": "Apple has invited the tech press to a “special Apple experience” on March 4, but it might unfold a bit differently than the company's standard press event."
        },
        {
          "title": "Apple’s iOS 26.4 arrives in public beta with AI music playlists, video podcasts, and more",
          "link": "https://techcrunch.com/2026/02/20/apples-ios-26-4-arrives-in-public-beta-with-ai-music-playlists-video-podcasts-and-more/",
          "content": "Several updates are introduced in iOS 26.4, including an AI-powered playlist-generation feature in Apple Music, support for video content in the Podcasts app, end-to-end encry"
        },
        {
          "title": "Rivian owners will soon be able to access vehicle controls using their Apple Watch",
          "link": "https://techcrunch.com/2026/02/19/rivian-owners-will-be-able-to-access-vehicle-controls-through-their-apple-watch/",
          "content": "Rivian is launching a companion app that pairs with Apple Watch in the coming week."
        }
      ]
    },
    {
      "name": "Microsoft",
      "humanUrl": "https://techcrunch.com/tag/microsoft/",
      "items": [
        {
          "title": "The White House wants AI companies to cover rate hikes. Most have already said they would.",
          "link": "https://techcrunch.com/2026/02/25/the-white-house-wants-ai-companies-to-cover-rate-hikes-most-have-already-said-they-would/",
          "content": "Many hyperscalers have already made public commitments to cover electricity cost increases."
        },
        {
          "title": "The public opposition to AI infrastructure is heating up",
          "link": "https://techcrunch.com/2026/02/25/the-public-opposition-to-ai-infrastructure-is-heating-up/",
          "content": "Public backlash over the data center boom is leading to a variety of draconian policies — including bans on new construction."
        },
        {
          "title": "All the important news from the ongoing India AI Impact Summit",
          "link": "https://techcrunch.com/2026/02/22/all-the-important-news-from-the-ongoing-india-ai-summit/",
          "content": "India is hosting a four-day AI Summit this week that will be attended by executives from major AI labs and Big Tech, including OpenAI, Anthropic, Nvidia, Microsoft, Google, an"
        },
        {
          "title": "Microsoft’s new gaming CEO vows not to flood the ecosystem with ‘endless AI slop’",
          "link": "https://techcrunch.com/2026/02/21/microsofts-new-gaming-ceo-vows-not-to-flood-the-ecosystem-with-endless-ai-slop/",
          "content": "Is Microsoft's gaming division doubling down on AI?"
        }
      ]
    },
    {
      "name": "Business",
      "humanUrl": "https://www.nytimes.com/section/business",
      "items": [
        {
          "title": "Banks Are Becoming Bulwarks for Vulnerable Seniors",
          "link": "https://www.nytimes.com/2026/02/28/health/scams-elderly-banks.html",
          "content": "Older Americans are losing billions of dollars annually to financial exploitation. Banks and investment firms are training employees to spot red flags and stop the transaction"
        },
        {
          "title": "Lloyd Blankfein on Trump, Epstein and Life After Goldman Sachs",
          "link": "https://www.nytimes.com/2026/02/28/business/dealbook/lloyd-blankfein-book.html",
          "content": "In a wide-ranging interview with Andrew Ross Sorkin, Goldman’s former C.E.O. discussed his life and new memoir."
        },
        {
          "title": "Netflix Lost Warner. Maybe That’s a Good Thing.",
          "link": "https://www.nytimes.com/2026/02/28/business/media/netflix-lost-warner-maybe-thats-a-good-thing.html",
          "content": "It is entirely possible, analysts say, that Netflix will be better off by bailing from its $83 billion deal with Warner Bros. Discovery."
        },
        {
          "title": "Abrupt Change for Warner Bros. Prompts Many Grim Faces",
          "link": "https://www.nytimes.com/2026/02/28/business/warner-bros-paramount-reaction.html",
          "content": "Employees at the company had started to warm to the idea of Netflix as its corporate owner. Now they face the prospect of major cuts under Paramount."
        }
      ]
    }
  ]
}
